const cardDataShoe = [
  {
    id: 1,
    title: "รองเท้า ",
    title1: "NIKE AIR ZOOM G.T.",
    description: "รองเท้าที่เหมาะสำหรับ ผู้เล่นตำแหน่ง SG,PG",
    price: "ราคา 6200 บาท",
    howto: [
      "ยึดเกาะพื้นได้ดี",
      "รองรับแรงกระแทกได้ดี",
      "คล่องตัวสูง",
      "มีน้ำหนักที่เบา",
      "เล่นได้ทั้ง พื้นปูนขรุขระและพื้นปูนขัด",
      "ตัวรองเท้าไม่ค่อยติดฝุ่นได้ง่าย",
      "เบรครองเท้าได้ดีมาก",
    ],
    to: [
      "ให้เชือกมาสั้นนิดหน่อยมีโอกาสหลุดง่าย",
      "ต้องนวดรองเท้าก่อน",
      "รองเท้าจะไม่ได้ช่วยเรื่องกันรองเท้าพลิก",
    ],
    imageUrl: "/picture/Nike-G.T.-Cut2.png",
  },
  {
    id: 2,
    title: "รองเท้า  ",
    title1:"BIG3 3.0 Pro sepatu",
    description: "รองเท้าที่เหมาะสำหรับ ผู้เล่นตำแหน่ง PG,SF",
    price: "ราคา 2100 บาท",
    howto: [
      "ความหนึบของพื้นรองเท้าดีมาก",
      "เบรครองเท้าได้ในระดับกลางๆ",
      "ความคล่องตัวสูง",
      "กระชับและพอดีเท้า",
      "รองรับแรงกระแทกได้ดี",
    ],
    to: ["จำเป็นต้องนวดรองเท้าก่อน", "ใส่ตอนแรกๆจะคัพเท้าหน่อย"],
    imageUrl: "/picture/BIG3-3.0-sepatu.jfif",
  },
  {
    id: 3,
    title: "รองเท้า  ",
    title1: "kyrie shock wave 5",
    description: "รองเท้าที่เหมาะสำหรับ ผู้เล่นตำแหน่ง PG,SF ",
    price: "ราคา 2500 บาท",
    howto: [
      "รองรับทุกจังหวะการเล่น",
      "ระบบรองรับแรงกระแทกและตอบสนองดี",
      "กระชับเลย ใส่สบาย",
    ],
    to: [
      "วัสดุดูธรรมดา, พลาสติกไม้มือ",
      "สำหรับผู้เล่นที่มีน้ำหนักมาก อาจรู้สึกแรงกระแทกน้อยไป",
      "ส่วน insole อาจเลื่อนหรือสไลด์",
    ],
    imageUrl: "/picture/shock-wave-5.webp",
  },
  {
    id: 4,
    title: "รองเท้า  ",
    title1: " Nike Zoom KOBE 6",
    description: "รองเท้าที่เหมาะสำหรับ ผู้เล่นตำแหน่ง PG",
    price: "ราคา 9500 บาท",
    howto: [
      "กระชับพอดีรูปเท้า",
      "โฟม & ราคองรับแรงกระแทก",
      "ยึดเกาะพื้นลื่นได้ดี",
      "น้ำหนักเบา & ความคล่องตัวสูง",
    ],
    to: [
      "ยึดเกาะต้องเบรกอิน",
      "อาจรู้สึกส้นเท้าหลวมช่วงเบรกอิน",
      "ส้นยางอ่อน, ทนพื้นนอกได้ไม่ดี",
      "หายากและราคาแพง",
    ],
    imageUrl: "/picture/Nike-KOBE-6.jpeg",
  },
];

const cardDataShirt = [
  {
    id: 5,
    title: "เสื้อบาสลาย ",
    title1: "(Lebron James)",
    description: "เนื้อผ้านุ่มใส่สบายไม่อึดอัด",
    price: "ราคา 820 บาท",
    howto: ["เนื้อผ้าดีไม่เป็นคุ้ย", "ใส่ง่าย", "มีทุกไซส์", "ลายสวย"],
    to: ["ไม่มี"],
    imageUrl: "/picture/Le.jpg",
  },
  {
    id: 6,
    title: "เสื้อบาสลาย",
    title1: "(Luka Doncic)",
    description: "เนื้อผ้านุ่มใส่สบายไม่อึดอัด",
    price: "ราคา 940 บาท",
    howto: ["เนื้อผ้าดีไม่เป็นคุ้ย", "ใส่ง่าย", "มีทุกไซส์", "ลายสวย"],
    to: ["ไม่มี"],
    imageUrl: "/picture/Ld.jpg",
  },
  {
    id: 7,
    title: "เสื้อบาสลาย",
    title1: "(Jason Tatum)",
    description: "เนื้อผ้านุ่มใส่สบายไม่อึดอัด",
    price: "ราคา 940 บาท",
    howto: ["เนื้อผ้าดีไม่เป็นคุ้ย", "ใส่ง่าย", "มีทุกไซส์", "ลายสวย"],
    to: ["ไม่มี"],
    imageUrl: "/picture/Ev.jpg",
  },
  {
    id: 8,
    title: "เสื้อบาสลาย",
    title1: "(The Goat)",
    description: "เนื้อผ้านุ่มใส่สบายไม่อึดอัด",
    price: "ราคา 940 บาท",
    howto: ["เนื้อผ้าดีไม่เป็นคุ้ย", "ใส่ง่าย", "มีทุกไซส์", "ลายสวย"],
    to: ["ไม่มี"],
    imageUrl: "/picture/gold.jpg",
  },
];

const cardDataPants = [
  {
    id: 9,
    title: "กางเกง (XYZ)",
    description: "ดีไซส์สวย น้ำเงิน-ขาว-แดง",
    price: "ราคา 490 บาท",
    howto: ["ระบายอากาศได้ดี", "ใส่ได้พอดี ของแต่ละไซส์"],
    to: ["ไม่เหมาะสำหรับคนที่อยากใส่กางเกงสั้นเล่นบาส"],
    imageUrl: "/picture/OIP(2).webp",
  },
  {
    id: 10,
    title: "กางเกง (XYZ)",
    description: "ดีไซส์สวย ชมพู-ฟ้า-เหลือง",
    price: "ราคา 490 บาท",
    howto: ["ระบายอากาศได้ดี", "เป็นกางเกงที่ยาวพอสมควรเกือบถึงหัวเข่า"],
    to: ["ไม่เหมาะสำหรับคนที่อยากใส่กางเกงสั้นเล่นบาส"],
    imageUrl: "/picture/OIP(1).webp",
  },
  {
    id: 11,
    title: "กางเกง (XYZ)",
    description: "ดีไซส์สวย ดำ-เหลือง-ฟ้า-ชมพู",
    price: "ราคา 490 บาท",
    howto: [
      "ระบายอากาศได้ดี",
      "เป็นกางเกงที่สั้นเหมาะสมหรับคนที่ชอบเลี้ยงหริอความคล่องตัวดี",
    ],
    to: ["ไม่เหมาะสำหรับคนที่อยากใส่กางเกงยาวเล่นบาส", "เชือกสั้นเล็กน้อย"],
    imageUrl: "/picture/OIP(3).webp",
  },
  {
    id: 12,
    title: "กางเกง (XYZ)",
    description: "ดีไซส์สวย ม่วง-ชมพู-เขียว-ขาว",
    price: "ราคา 490 บาท",
    howto: [
      "ระบายอากาศได้ดี",
      "เป็นกางเกงที่สั้นเหมาะสมหรับคนที่ชอบเลี้ยงหริอความคล่องตัวดี",
    ],
    to: ["ไม่เหมาะสำหรับคนที่อยากใส่กางเกงยาวเล่นบาส", "ไม่มีเชือก"],
    imageUrl: "/picture/OIP(4).webp",
  },
];

const cardDataEquipment = [
  {
    id: 13,
    title: "ลูกบาสเกตบอล ",
    title1: "(Basketball)",
    description: "ลูกบาสเบอร์ 7",
    price: "ราคา 1200 บาท",
    howto: ["ขนาดมาตราฐาน", "ใช้เล่นได้ทุกสนาม"],
    to: ["เป็นบาสที่นิยม ควรจะทำสัญลักษณ์ไว้เพื่อหาย"],
    imageUrl: "/picture/OIP(5).webp",
  },
  {
    id: 14,
    title: "แป้นบาส ",
    title1: "(Basketball hoop)",
    description: "แป้นบาสชู้ตได้ที่บ้าน",
    price: "ราคา 2230 บาท",
    howto: [
      "ติดตั้งง่าย มีคู่มือ",
      "สามารถปรับความสูงได้",
      "ฝึกซ้อมชู้ตได้ที่บ้านได้ดี",
    ],
    to: ["ดั้งก์ไม่ได้", "ห้ามตากฝน"],
    imageUrl: "/picture/spalding.jpg",
  },
  {
    id: 15,
    title: "สนับเข่า ",
    title1: "(Knee support)",
    description: "ป้องกันเข่าบาดเจ็บ",
    price: "ราคา 600 บาท",
    howto: ["ช่วยป้องกันเข่าได้จากการกระโดดบ่อยๆหรือกระแทกพื้น"],
    to: ["มันจะรัดเข่าอาจจะขยับได้ลำบาก"],
    imageUrl: "/picture/THATA-Knee-Support.webp",
  },
  {
    id: 16,
    title: "เทปพันนิ้ว ",
    title1: "(Finger tape)",
    description: "กันนิ้วซ้น",
    price: "ราคา 90 บาท",
    howto: ["กันนิ้วซ้นไม่ให้บาดเจ็บ"],
    to: ["ขยับนิ้วลำบาก"],
    imageUrl: "/picture/pt.jfif",
  },
];

{
  /* รวม */
}
const allCardData = [
  ...cardDataShoe,
  ...cardDataShirt,
  ...cardDataPants,
  ...cardDataEquipment,
];

allCardData.forEach((card) => {
  if (card.id >= 1 && card.id <= 4) {
    card.location = "Shoe";
  } else if (card.id >= 5 && card.id <= 8) {
    card.location = "Shirt";
  } else if (card.id >= 9 && card.id <= 12) {
    card.location = "Pants";
  } else if (card.id >= 13 && card.id <= 16) {
    card.location = "Equipment";
  }
});

export default allCardData;
